# 2.3. DataFrames II - Pandas
---

<img src="https://selecao.letscode.com.br/favicon.png" width="40px" style="position: absolute; top: 15px; right: 40px; border-radius: 5px;" />

## Roteiro do Conteúdo

- Transformação de dados
  - `map`
  - `get_dummies`
  - `apply` e `applymap`
- Tratamento de dados ausentes
- Juntando DataFrames
- [Estilização de DataFrames](https://www.youtube.com/watch?v=wc6WqMNwUCw)

In [1]:
import pandas as pd
import numpy as np

In [2]:
pessoas = {
  'Nome': ['Fulano', 'Ciclano', 'Fulana', 'Ciclana'],
  'Peso': [70, 56, 60, 68],
  'Altura': [1.67, 1.7, 1.55, 1.64]
}

df = pd.DataFrame(pessoas)

In [3]:
df.head()

      Nome  Peso  Altura
0   Fulano    70    1.67
1  Ciclano    56    1.70
2   Fulana    60    1.55
3  Ciclana    68    1.64

In [4]:
df['IMC'] = df['Peso'] / df['Altura']**2

In [5]:
df

      Nome  Peso  Altura        IMC
0   Fulano    70    1.67  25.099502
1  Ciclano    56    1.70  19.377163
2   Fulana    60    1.55  24.973985
3  Ciclana    68    1.64  25.282570

In [6]:
titanic = pd.read_csv('https://s3-sa-east-1.amazonaws.com/lcpi/5729687e-ae14-4978-8cd7-7ef18277813d.csv')

In [7]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:
titanic.Sex.unique()

array(['male', 'female'], dtype=object)

### Transformação de Dados

#### 1. `map`

In [10]:
df.values

array([['Fulano', 70, 1.67, 25.099501595611173],
       ['Ciclano', 56, 1.7, 19.377162629757787],
       ['Fulana', 60, 1.55, 24.97398543184183],
       ['Ciclana', 68, 1.64, 25.282569898869724]], dtype=object)

In [11]:
titanic.values

array([[1, 0, 3, ..., 7.25, nan, 'S'],
       [2, 1, 1, ..., 71.2833, 'C85', 'C'],
       [3, 1, 3, ..., 7.925, nan, 'S'],
       ...,
       [889, 0, 3, ..., 23.45, nan, 'S'],
       [890, 1, 1, ..., 30.0, 'C148', 'C'],
       [891, 0, 3, ..., 7.75, nan, 'Q']], dtype=object)

In [14]:
# Relembrando o map
list( map(str, [1, 2, 3]) )

['1', '2', '3']

In [22]:
titanic['Sex'].replace({
  'male': 0,
  'female': 1
})

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    1
889    0
890    0
Name: Sex, Length: 891, dtype: int64

In [20]:
titanic['Sex'].map({
  'male': 0,
  'female': 1
})

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    1
889    0
890    0
Name: Sex, Length: 891, dtype: int64

In [ ]:
df.replace(to_replace=r'^ba.$', value='new', regex=True)

#### 2. `apply`

Aplicar uma função sobre o DataFrame (ou uma Series).

1. Funções pré-implementadas
2. Funções: def
3. Funções lambda

### Aplicando o `apply` apenas em uma `Series`

In [23]:
df

      Nome  Peso  Altura        IMC
0   Fulano    70    1.67  25.099502
1  Ciclano    56    1.70  19.377163
2   Fulana    60    1.55  24.973985
3  Ciclana    68    1.64  25.282570

In [28]:
df.Peso.map(lambda peso: peso + 2)

0    72
1    58
2    62
3    70
Name: Peso, dtype: int64

In [27]:
def somar2(peso):
  # peso += 2
  # pass
  return peso + 2

df['Peso'].apply(somar2)

0    72
1    58
2    62
3    70
Name: Peso, dtype: int64

In [29]:
df['Peso'].apply(lambda peso: peso + 2)

0    72
1    58
2    62
3    70
Name: Peso, dtype: int64

In [31]:
# Aplicando o apply para uma string
def alterar_nome(nome):
  return nome + ' Sobrenome'

df['Nome'] = df['Nome'].apply(alterar_nome)

In [32]:
df

                Nome  Peso  Altura        IMC
0   Fulano Sobrenome    70    1.67  25.099502
1  Ciclano Sobrenome    56    1.70  19.377163
2   Fulana Sobrenome    60    1.55  24.973985
3  Ciclana Sobrenome    68    1.64  25.282570

### Aplicando o `apply` no `DataFrame`

In [34]:
def funcao(alguma_coisa):
  print(alguma_coisa, '\n')

df.apply(funcao)

0     Fulano Sobrenome
1    Ciclano Sobrenome
2     Fulana Sobrenome
3    Ciclana Sobrenome
Name: Nome, dtype: object

0    70
1    56
2    60
3    68
Name: Peso, dtype: int64

0    1.67
1    1.70
2    1.55
3    1.64
Name: Altura, dtype: float64

0    25.099502
1    19.377163
2    24.973985
3    25.282570
Name: IMC, dtype: float64

Nome      None
Peso      None
Altura    None
IMC       None
dtype: object

#### Desafio

Crie uma nova coluna com a indicação da classificação do IMC na qual a pessoa se enquadra.

In [43]:
def funcao(linha):
  altura = linha['Altura']
  peso = linha['Peso']
  imc = peso / altura**2

  if imc >= 18.5 and imc < 25:
    return 'Peso normal'
  elif imc >= 25 and imc < 30:
    return 'Acima do peso'

df['Classificacao'] = df.apply(funcao, axis=1)

In [44]:
df

                Nome  Peso  Altura        IMC  Classificacao
0   Fulano Sobrenome    70    1.67  25.099502  Acima do peso
1  Ciclano Sobrenome    56    1.70  19.377163    Peso normal
2   Fulana Sobrenome    60    1.55  24.973985    Peso normal
3  Ciclana Sobrenome    68    1.64  25.282570  Acima do peso

#### 3. `get_dummies`

Útil na conversão de dados categóricos (qualitativos) em dados numéricos (quantitativos).

In [45]:
df = pd.read_csv('https://s3-sa-east-1.amazonaws.com/lcpi/6e4f0eea-5f67-4e91-ae19-8343df190003.csv')

In [46]:
df.head()

  Species  Weight  Length1  Length2  Length3   Height   Width
0   Bream   242.0     23.2     25.4     30.0  11.5200  4.0200
1   Bream   290.0     24.0     26.3     31.2  12.4800  4.3056
2   Bream   340.0     23.9     26.5     31.1  12.3778  4.6961
3   Bream   363.0     26.3     29.0     33.5  12.7300  4.4555
4   Bream   430.0     26.5     29.0     34.0  12.4440  5.1340

In [48]:
df.Species.unique()

array(['Bream', 'Roach', 'Whitefish', 'Parkki', 'Perch', 'Pike', 'Smelt'],
      dtype=object)

In [49]:
df.Species.nunique()

7

In [52]:
df.tail()

    Species  Weight  Length1  Length2  Length3  Height   Width
154   Smelt    12.2     11.5     12.2     13.4  2.0904  1.3936
155   Smelt    13.4     11.7     12.4     13.5  2.4300  1.2690
156   Smelt    12.2     12.1     13.0     13.8  2.2770  1.2558
157   Smelt    19.7     13.2     14.3     15.2  2.8728  2.0672
158   Smelt    19.9     13.8     15.0     16.2  2.9322  1.8792

In [50]:
pd.get_dummies(df)

,Weight,Length1,Length2,Length3,Height,Width,Species_Bream,Species_Parkki,Species_Perch,Species_Pike,Species_Roach,Species_Smelt,Species_Whitefish
0,242.0,23.2,25.4,30.0,11.5200,4.0200,1,0,0,0,0,0,0
1,290.0,24.0,26.3,31.2,12.4800,4.3056,1,0,0,0,0,0,0
2,340.0,23.9,26.5,31.1,12.3778,4.6961,1,0,0,0,0,0,0
3,363.0,26.3,29.0,33.5,12.7300,4.4555,1,0,0,0,0,0,0
4,430.0,26.5,29.0,34.0,12.4440,5.1340,1,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
154,12.2,11.5,12.2,13.4,2.0904,1.3936,0,0,0,0,0,1,0
155,13.4,11.7,12.4,13.5,2.4300,1.2690,0,0,0,0,0,1,0
156,12.2,12.1,13.0,13.8,2.2770,1.2558,0,0,0,0,0,1,0
157,19.7,13.2,14.3,15.2,2.8728,2.0672,0,0,0,0,0,1,0
158,19.9,13.8,15.0,16.2,2.9322,1.8792,0,0,0,0,0,1,0

In [56]:
# Escolhendo as colunas onde eu quero que aconteça a condificação

pd.get_dummies(titanic, columns=['Sex'])

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_female,Sex_male
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,S,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,C,1,0
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,C123,S,1,0
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,NaN,S,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",27.0,0,0,211536,13.0000,NaN,S,0,1
887,888,1,1,"Graham, Miss. Margaret Edith",19.0,0,0,112053,30.0000,B42,S,1,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",NaN,1,2,W./C. 6607,23.4500,NaN,S,1,0
889,890,1,1,"Behr, Mr. Karl Howell",26.0,0,0,111369,30.0000,C148,C,0,1
890,891,0,3,"Dooley, Mr. Patrick",32.0,0,0,370376,7.7500,NaN,Q,0,1

In [58]:
# Para remover a coluna redundante

pd.get_dummies(df, drop_first=True)

,Weight,Length1,Length2,Length3,Height,Width,Species_Parkki,Species_Perch,Species_Pike,Species_Roach,Species_Smelt,Species_Whitefish
0,242.0,23.2,25.4,30.0,11.5200,4.0200,0,0,0,0,0,0
1,290.0,24.0,26.3,31.2,12.4800,4.3056,0,0,0,0,0,0
2,340.0,23.9,26.5,31.1,12.3778,4.6961,0,0,0,0,0,0
3,363.0,26.3,29.0,33.5,12.7300,4.4555,0,0,0,0,0,0
4,430.0,26.5,29.0,34.0,12.4440,5.1340,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
154,12.2,11.5,12.2,13.4,2.0904,1.3936,0,0,0,0,1,0
155,13.4,11.7,12.4,13.5,2.4300,1.2690,0,0,0,0,1,0
156,12.2,12.1,13.0,13.8,2.2770,1.2558,0,0,0,0,1,0
157,19.7,13.2,14.3,15.2,2.8728,2.0672,0,0,0,0,1,0
158,19.9,13.8,15.0,16.2,2.9322,1.8792,0,0,0,0,1,0

In [59]:
pd.get_dummies(titanic, columns=['Sex', 'Embarked'], drop_first=True)

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Sex_male,Embarked_Q,Embarked_S
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,1,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,0,0,0
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,NaN,0,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,C123,0,0,1
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,NaN,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",27.0,0,0,211536,13.0000,NaN,1,0,1
887,888,1,1,"Graham, Miss. Margaret Edith",19.0,0,0,112053,30.0000,B42,0,0,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",NaN,1,2,W./C. 6607,23.4500,NaN,0,0,1
889,890,1,1,"Behr, Mr. Karl Howell",26.0,0,0,111369,30.0000,C148,1,0,0
890,891,0,3,"Dooley, Mr. Patrick",32.0,0,0,370376,7.7500,NaN,1,1,0

## Tratamento de Dados Ausentes

1. `isnull/isna`
2. `dropna`
3. `fillna`

In [60]:
# Primeiro Exemplo
dados = np.array([[1,      2, np.nan],
                  [4, np.nan, np.nan],
                  [7,      8,      9]])

df_exemplo = pd.DataFrame(dados, columns='A B C'.split())

In [61]:
df_exemplo

     A    B    C
0  1.0  2.0  NaN
1  4.0  NaN  NaN
2  7.0  8.0  9.0

In [62]:
df_exemplo.isnull()

       A      B      C
0  False  False   True
1  False   True   True
2  False  False  False

In [63]:
# Contar quantos nulos (nan)
df_exemplo.isnull().sum()

A    0
B    1
C    2
dtype: int64

In [64]:
# Alternativamente...
df_exemplo.isna()

       A      B      C
0  False  False   True
1  False   True   True
2  False  False  False

### dropna

Serve para remover os dados ausentes.

In [66]:
df_exemplo

     A    B    C
0  1.0  2.0  NaN
1  4.0  NaN  NaN
2  7.0  8.0  9.0

In [65]:
df_exemplo.dropna()

     A    B    C
2  7.0  8.0  9.0

### fillna

Serve para preencher dados ausentes.

In [68]:
df_exemplo.fillna(0)

     A    B    C
0  1.0  2.0  0.0
1  4.0  0.0  0.0
2  7.0  8.0  9.0

In [71]:
df_exemplo

     A    B    C
0  1.0  2.0  NaN
1  4.0  NaN  NaN
2  7.0  8.0  9.0

In [70]:
df_exemplo.fillna(method='ffill')

     A    B    C
0  1.0  2.0  NaN
1  4.0  2.0  NaN
2  7.0  8.0  9.0

In [72]:
df_exemplo.fillna(method='bfill')

     A    B    C
0  1.0  2.0  9.0
1  4.0  8.0  9.0
2  7.0  8.0  9.0

### Dataset do Titanic

In [106]:
titanic = pd.read_csv('https://s3-sa-east-1.amazonaws.com/lcpi/5729687e-ae14-4978-8cd7-7ef18277813d.csv')

In [107]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [108]:
def show_nan_stats(df):
  print('>> VALORES ABSOLUTOS <<')
  print(df.isnull().sum(), '\n')
  
  print('>> VALORES PERCENTUAIS <<')
  print(df.isnull().sum() / df.shape[0] * 100)

In [109]:
show_nan_stats(titanic)

>> VALORES ABSOLUTOS <<
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

>> VALORES PERCENTUAIS <<
PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64

In [110]:
# 1. Eliminar a coluna Cabin, porque ela tem quase 80% de dados ausentes/faltantes
titanic.drop('Cabin', axis=1, inplace=True)

In [111]:
show_nan_stats(titanic)

>> VALORES ABSOLUTOS <<
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

>> VALORES PERCENTUAIS <<
PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Embarked        0.224467
dtype: float64

In [113]:
# 2. Coluna Embarked
titanic.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [115]:
titanic['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [116]:
titanic['Embarked'].value_counts(True)

S    0.724409
C    0.188976
Q    0.086614
Name: Embarked, dtype: float64

In [119]:
titanic['Embarked'] = titanic['Embarked'].fillna('S')

In [120]:
show_nan_stats(titanic)

>> VALORES ABSOLUTOS <<
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         0
dtype: int64

>> VALORES PERCENTUAIS <<
PassengerId     0.00000
Survived        0.00000
Pclass          0.00000
Name            0.00000
Sex             0.00000
Age            19.86532
SibSp           0.00000
Parch           0.00000
Ticket          0.00000
Fare            0.00000
Embarked        0.00000
dtype: float64

In [121]:
titanic['Age'].mean()

29.69911764705882

In [122]:
titanic['Age'].median()

28.0

In [125]:
titanic['Age'].fillna(titanic['Age'].median())

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    28.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [126]:
titanic.Age.std()

14.526497332334042

In [149]:
# Preenchendo com a mediana + ou - o desvio padrão

def fill_age(age):
  if np.isnan(age):
    return titanic['Age'].median() + (np.random.randn() * titanic['Age'].std())
  
  return age

In [151]:
titanic['Age'].apply(fill_age)

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    41.435589
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

In [155]:
index_age_nan = titanic[titanic['Age'].isnull()].index

In [157]:
titanic.iloc[index_age_nan]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,Q
...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,S

In [164]:
titanic['Age'].apply(fill_age)[index_age_nan]

5      43.459707
17     54.388469
19     57.875953
26     14.434224
28     15.107598
         ...
859    29.253952
863    53.765924
868    17.029725
878    44.968266
888    18.708795
Name: Age, Length: 177, dtype: float64

## Junção de DataFrames

In [9]:
np.arange(1, 10)

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [2]:
dados = np.arange(1, 10).reshape(3,3)

In [3]:
dados

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [12]:
df1 = pd.DataFrame(dados, columns='A B C'.split())
df2 = pd.DataFrame(dados, columns='A B C'.split())
df3 = pd.DataFrame(dados, columns='D E F'.split())

In [13]:
df1

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [14]:
df2

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [15]:
df3

   D  E  F
0  1  2  3
1  4  5  6
2  7  8  9

#### `concat`, semelhante ao `UNION` do SQL

In [18]:
pd.concat([df1, df2])

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9
0  1  2  3
1  4  5  6
2  7  8  9

In [19]:
pd.concat([df1, df2], ignore_index=True)

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9
3  1  2  3
4  4  5  6
5  7  8  9

In [20]:
pd.concat([df1, df2, df3], ignore_index=True)

     A    B    C    D    E    F
0  1.0  2.0  3.0  NaN  NaN  NaN
1  4.0  5.0  6.0  NaN  NaN  NaN
2  7.0  8.0  9.0  NaN  NaN  NaN
3  1.0  2.0  3.0  NaN  NaN  NaN
4  4.0  5.0  6.0  NaN  NaN  NaN
5  7.0  8.0  9.0  NaN  NaN  NaN
6  NaN  NaN  NaN  1.0  2.0  3.0
7  NaN  NaN  NaN  4.0  5.0  6.0
8  NaN  NaN  NaN  7.0  8.0  9.0

In [24]:
# Concatenação horizontal
pd.concat([df2, df3], axis=1)

   A  B  C  D  E  F
0  1  2  3  1  2  3
1  4  5  6  4  5  6
2  7  8  9  7  8  9

In [25]:
df4 = pd.DataFrame(dados, columns='D E F'.split(), index=[1, 2, 3])

In [26]:
df4

   D  E  F
1  1  2  3
2  4  5  6
3  7  8  9

In [27]:
pd.concat([df2, df4], axis=1)

     A    B    C    D    E    F
0  1.0  2.0  3.0  NaN  NaN  NaN
1  4.0  5.0  6.0  1.0  2.0  3.0
2  7.0  8.0  9.0  4.0  5.0  6.0
3  NaN  NaN  NaN  7.0  8.0  9.0

#### `merge`: semelhante ao `JOIN` do SQL

In [29]:
movies = pd.read_csv('../00. Datasets/movies.csv')
ratings = pd.read_csv('../00. Datasets/ratings.csv')

In [30]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [32]:
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

#### Consulta SQL

```sql
SELECT * FROM movies
  INNER JOIN ratings
    ON movies.id = ratings.movieId;
```

In [40]:
pd.merge(movies, ratings)

,movieId,title,genres,userId,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1,4.0,964982703
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,5,4.0,847434962
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,7,4.5,1106635946
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,15,2.5,1510577970
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,17,4.5,1305696483
...,...,...,...,...,...,...
100831,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy,184,4.0,1537109082
100832,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy,184,3.5,1537109545
100833,193585,Flint (2017),Drama,184,3.5,1537109805
100834,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation,184,3.5,1537110021
100835,193609,Andrew Dice Clay: Dice Rules (1991),Comedy,331,4.0,1537157606

In [41]:
pd.merge(movies, ratings, on='movieId')

,movieId,title,genres,userId,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1,4.0,964982703
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,5,4.0,847434962
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,7,4.5,1106635946
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,15,2.5,1510577970
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,17,4.5,1305696483
...,...,...,...,...,...,...
100831,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy,184,4.0,1537109082
100832,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy,184,3.5,1537109545
100833,193585,Flint (2017),Drama,184,3.5,1537109805
100834,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation,184,3.5,1537110021
100835,193609,Andrew Dice Clay: Dice Rules (1991),Comedy,331,4.0,1537157606

In [42]:
pd.merge(movies, ratings, on='movieId', how='inner')

,movieId,title,genres,userId,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1,4.0,964982703
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,5,4.0,847434962
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,7,4.5,1106635946
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,15,2.5,1510577970
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,17,4.5,1305696483
...,...,...,...,...,...,...
100831,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy,184,4.0,1537109082
100832,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy,184,3.5,1537109545
100833,193585,Flint (2017),Drama,184,3.5,1537109805
100834,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation,184,3.5,1537110021
100835,193609,Andrew Dice Clay: Dice Rules (1991),Comedy,331,4.0,1537157606

In [44]:
pd.merge(movies, ratings, on='movieId', how='left')

,movieId,title,genres,userId,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1.0,4.0,9.649827e+08
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,5.0,4.0,8.474350e+08
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,7.0,4.5,1.106636e+09
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,15.0,2.5,1.510578e+09
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,17.0,4.5,1.305696e+09
...,...,...,...,...,...,...
100849,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy,184.0,4.0,1.537109e+09
100850,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy,184.0,3.5,1.537110e+09
100851,193585,Flint (2017),Drama,184.0,3.5,1.537110e+09
100852,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation,184.0,3.5,1.537110e+09
100853,193609,Andrew Dice Clay: Dice Rules (1991),Comedy,331.0,4.0,1.537158e+09

In [45]:
pd.merge(movies, ratings, on='movieId', how='right')

,movieId,title,genres,userId,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1,4.0,964982703
1,3,Grumpier Old Men (1995),Comedy|Romance,1,4.0,964981247
2,6,Heat (1995),Action|Crime|Thriller,1,4.0,964982224
3,47,Seven (a.k.a. Se7en) (1995),Mystery|Thriller,1,5.0,964983815
4,50,"Usual Suspects, The (1995)",Crime|Mystery|Thriller,1,5.0,964982931
...,...,...,...,...,...,...
100831,166534,Split (2017),Drama|Horror|Thriller,610,4.0,1493848402
100832,168248,John Wick: Chapter Two (2017),Action|Crime|Thriller,610,5.0,1493850091
100833,168250,Get Out (2017),Horror,610,5.0,1494273047
100834,168252,Logan (2017),Action|Sci-Fi,610,5.0,1493846352
100835,170875,The Fate of the Furious (2017),Action|Crime|Drama|Thriller,610,3.0,1493846415

In [46]:
pd.merge(movies, ratings, on='movieId', how='left').isnull().sum()

movieId       0
title         0
genres        0
userId       18
rating       18
timestamp    18
dtype: int64

#### `join`

In [50]:
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [51]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [52]:
movies.shape

(9742, 3)

In [53]:
ratings.shape

(100836, 4)

In [48]:
movies.join(ratings, lsuffix='_movies', rsuffix='_ratings')

,movieId_movies,title,genres,userId,movieId_ratings,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1,1,4.0,964982703
1,2,Jumanji (1995),Adventure|Children|Fantasy,1,3,4.0,964981247
2,3,Grumpier Old Men (1995),Comedy|Romance,1,6,4.0,964982224
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance,1,47,5.0,964983815
4,5,Father of the Bride Part II (1995),Comedy,1,50,5.0,964982931
...,...,...,...,...,...,...,...
9737,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy,64,3481,4.0,1161520665
9738,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy,64,3489,3.0,1161559689
9739,193585,Flint (2017),Drama,64,3499,4.5,1161559601
9740,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation,64,3510,3.0,1161559646
9741,193609,Andrew Dice Clay: Dice Rules (1991),Comedy,64,3526,4.0,1161566627

In [54]:
ratings.loc[9741]

userId       6.400000e+01
movieId      3.526000e+03
rating       4.000000e+00
timestamp    1.161567e+09
Name: 9741, dtype: float64

In [55]:
df2

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [56]:
df4

   D  E  F
1  1  2  3
2  4  5  6
3  7  8  9

In [57]:
df2.join(df4)

   A  B  C    D    E    F
0  1  2  3  NaN  NaN  NaN
1  4  5  6  1.0  2.0  3.0
2  7  8  9  4.0  5.0  6.0

In [58]:
df4.join(df2)

   D  E  F    A    B    C
1  1  2  3  4.0  5.0  6.0
2  4  5  6  7.0  8.0  9.0
3  7  8  9  NaN  NaN  NaN

In [59]:
df1

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [61]:
df1.join(pd.concat([df1, df2]), lsuffix='_left')

   A_left  B_left  C_left  A  B  C
0       1       2       3  1  2  3
0       1       2       3  1  2  3
1       4       5       6  4  5  6
1       4       5       6  4  5  6
2       7       8       9  7  8  9
2       7       8       9  7  8  9